In [63]:
import pandas as pd
import numpy as np

df = pd.read_excel("salary sheet template.xlsx")
df

,Sl. No,Month & Year,Emp. Code,Name of the employees,Date of Joining,Bank Name,Bank A/C,UAN no,ESI NO,Salary,...,Total deduction,Reimbursement of Expenses,Net Payment (Take Home),EPF (13%),ESI (3.25%),Bonus,Gratuity,LWF.1,Unnamed: 40,Unnamed: 41
0,1,2024-04-01,1001,Shopno Banerjee,1.4.2024,Axis Bank,1234,1234,1234,25000,...,1780,NaN,23220,1788,0,NaN,NaN,0,26788,26788
1,1,2024-04-01,1002,Shopno Banerjee,1.4.2024,Axis Bank,4321,4321,1234,25000,...,1780,NaN,23220,1788,0,NaN,NaN,0,26788,26788
2,1,2024-04-01,1003,Shopno Banerjee,1.4.2024,Axis Bank,4231,4231,1234,25000,...,1780,NaN,23220,1788,0,NaN,NaN,0,26788,26788
3,1,2024-04-01,1004,Shopno Banerjee,1.4.2024,Axis Bank,4444,4444,1234,25000,...,1780,NaN,23220,1788,0,NaN,NaN,0,26788,26788

In [64]:
df = df.rename(columns={'Net Payment (Take Home)': 'Net Payment'})

In [65]:
df.columns

Index(['Sl. No', 'Month & Year', 'Emp. Code', 'Name of the employees',
       'Date of Joining', 'Bank Name', 'Bank A/C', 'UAN no', 'ESI NO',
       'Salary', 'Basic (55%)', 'HRA (35%)', 'conveyance (5%)', 'Washing (5%)',
       'Extra Allowance', 'Total', 'Month Days', 'Actual', 'Leave', 'Total.1',
       'Extra ', 'Basic', 'HRA', 'conveyance', 'Washing', 'Extra', 'TOTAL',
       'P.T.', 'P.F.(12%)', 'ESI (0.75%)', 'LWF', 'Adv.', 'Total deduction',
       'Reimbursement of Expenses', 'Net Payment', 'EPF (13%)', 'ESI (3.25%)',
       'Bonus', 'Gratuity', 'LWF.1', 'Unnamed: 40', 'Unnamed: 41'],
      dtype='object')

In [66]:
df=df[['Month & Year', 'Name of the employees','UAN no','Actual','Basic', 'HRA', 'conveyance', 'Washing','Extra', 'TOTAL','P.T.', 'P.F.(12%)', 'ESI (0.75%)','Adv.', 'Total deduction','Net Payment']]
df=df.astype(str)
df['Adv.'] = df['Adv.'].str.replace('nan','-')
df

,Month & Year,Name of the employees,UAN no,Actual,Basic,HRA,conveyance,Washing,Extra,TOTAL,P.T.,P.F.(12%),ESI (0.75%),Adv.,Total deduction,Net Payment
0,2024-04-01,Shopno Banerjee,1234,30,13750,8750,1250,1250,-,25000,130,1650,0,-,1780,23220
1,2024-04-01,Shopno Banerjee,4321,30,13750,8750,1250,1250,-,25000,130,1650,0,-,1780,23220
2,2024-04-01,Shopno Banerjee,4231,30,13750,8750,1250,1250,-,25000,130,1650,0,-,1780,23220
3,2024-04-01,Shopno Banerjee,4444,30,13750,8750,1250,1250,-,25000,130,1650,0,-,1780,23220

In [67]:

columns = [['Month & Year', 'Name of the employees','UAN no',
            'Actual','Basic', 'HRA', 'conveyance', 'Washing','Extra', 'TOTAL',
            'P.T.', 'P.F.(12%)', 'ESI (0.75%)','Adv.', 'Total deduction','Net Payment']]

listy=[]
for index, row in df.iterrows():
    words=" "
    list=[]
    for col in columns:

        words = words + ' '.join(row[col])+' '
        list=words.split()
        listy.append(list)
        print(list)

print(listy)

    
    # for col in genre:
    #     row[col] = row[col].replace('[', '').replace(']', '').replace('\'', '')
    #     row[col] = row[col].replace(',', ' ')
    #     words = words + ''.join(row[col])+' '
    # for col in name:
    #     row[col] = row[col].replace(',', ' ')
    #     words = words + ' '.join(row[col])+' '

    # for col in keyword:
    #     words = words + ' '.join(row[col])+ ' '
    # for col in prod:    
    #     row[col] = row[col].replace('[', '').replace(']', '').replace('\'', '')
    # for col in scores:
    #     words = words + str(int(row[col]))
    # df.at[index,'bag_of_words'] = words.lower()
# df.head()

['2024-04-01', 'Shopno', 'Banerjee', '1234', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220']
['2024-04-01', 'Shopno', 'Banerjee', '4321', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220']
['2024-04-01', 'Shopno', 'Banerjee', '4231', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220']
['2024-04-01', 'Shopno', 'Banerjee', '4444', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220']
[['2024-04-01', 'Shopno', 'Banerjee', '1234', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220'], ['2024-04-01', 'Shopno', 'Banerjee', '4321', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220'], ['2024-04-01', 'Shopno', 'Banerjee', '4231', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220'], ['2024-04-01', 'Shopno', 'Banerjee', '4444', '30', '13750', '8750', '1250', '1250', '-', '25000', '130', '1650', '0', '-', '1780', '23220']]